proof/VELDO-0036/mutations/reservation-cancel-frees-exposure.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -245,0 +246,2 @@
+                if p['outcome'] == 'cancelled':
+                    value['charge'] = dict.fromkeys(USAGE, 0)
