proof/VELDO-0036/review-20260923/mutations/reservation-report-error-keeps-worker.diff
--- a/.veldo/control_reservation_runtime.py
+++ b/.veldo/control_reservation_runtime.py
@@ -74,2 +74,2 @@
-            # Reporting, authorization and policy reads must fail closed for the worker.
-            self._stop(active)
+            # Defect: report failure leaves the worker running.
+            pass
