proof/VELDO-0036/mutations/reservation-double-reported-usage.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -239 +239 @@
-                value['charge'][unit] = max(value['charge'].get(unit, 0), amount)
+                value['charge'][unit] = max(value['charge'].get(unit, 0), amount) + amount
