proof/VELDO-0036/mutations/reservation-ignore-ceiling.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -101 +101 @@
-                if balance[unit] + wanted.get(unit, 0) > cap:
+                if False:
