proof/VELDO-0036/mutations/reservation-ignore-cleanup.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -272 +272 @@
-            if observation.get('cleaned') is not True:
+            if False:
