proof/VELDO-0036/mutations/reservation-ignore-wall-time.diff
--- a/.veldo/control_reservation_runtime.py
+++ b/.veldo/control_reservation_runtime.py
@@ -44 +44 @@
-        reached = now - active['start'] >= active['wall_seconds']
+        reached = False
