proof/VELDO-0047/mutations/authority-install-starts-it.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -721,0 +722 @@
+    runner.run(['start', unit])  # defect: installation starts the authority
