proof/VELDO-0036/mutations/reservation-ignore-window.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -103 +103 @@
-            window = policy.get('window')
+            window = None
