proof/VELDO-0047/mutations/authority-key-existence-judged-alone.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -384 +384 @@
-        return problems + ['missing_authority:key_directory:absent']
+        return ['missing_authority:key_directory:absent']  # defect: an absent directory is judged by existence alone
