proof/VELDO-0036/mutations/reservation-parent-exit-releases-slot.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -270 +270 @@
-            if observation.get('terminated') is not True:
+            if False:
