proof/VELDO-0047/mutations/authority-receiver-workspace-omitted.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -636 +636 @@
-                                'authority_generation': first['authority_generation'], 'workspace': members[0],
+                                'authority_generation': first['authority_generation'], 'workspace': None,  # defect: the receiver judges no workspace
