proof/VELDO-0036/mutations/reservation-retry-after-launch.diff
--- a/.veldo/control_reservation_runtime.py
+++ b/.veldo/control_reservation_runtime.py
@@ -25,0 +26,2 @@
+        if boundary == 'retry':
+            self.launch(invocation, configuration)
