proof/VELDO-0047/mutations/authority-two-schedulers.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -531 +531 @@
-        fcntl.flock(fd, fcntl.LOCK_EX | fcntl.LOCK_NB)
+        pass  # defect: a second instance takes scheduling authority too
