proof/VELDO-0036/review-20260923/mutations/reservation-active-ignores-wall-cap.diff
--- a/.veldo/control_reservation_runtime.py
+++ b/.veldo/control_reservation_runtime.py
@@ -51,0 +52,2 @@
+                    if unit == 'wall_seconds':
+                        continue
