proof/VELDO-0047/mutations/authority-unit-restarts-on-failure.diff
--- a/.veldo/services/veldo-authority.service
+++ b/.veldo/services/veldo-authority.service
@@ -15 +15,2 @@
-Restart=no
+Restart=on-failure
+RestartSec=100ms
