proof/VELDO-0036/review-20260923/mutations/reservation-active-skips-project-cap.diff
--- a/.veldo/control_reservation_runtime.py
+++ b/.veldo/control_reservation_runtime.py
@@ -49,0 +50,2 @@
+                if policy['scope'] == 'project':
+                    continue
