proof/VELDO-0049/mutations/floor-authority-not-required.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -231,2 +231 @@
-            if EL.enrolled(self.repo_root):
-                raise EL.Stopped("authority_required")
+            pass  # defect: an enrolled repository runs without its authority
