proof/VELDO-0049/mutations/floor-projection-before-acceptance.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -388,0 +389 @@
+        floor.publish(sid)  # defect: published before the authority accepted the build
@@ -394 +395 @@
-        projection = floor.publish(sid)
+        projection = {}
