proof/VELDO-0036/review-20260923/mutations/reservation-final-forgets-reservation.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -249,0 +250 @@
+                value['charge']['wall_seconds'] = p['usage'].get('wall_seconds', 0)
