proof/VELDO-0049/mutations/floor-projection-before-acceptance.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -395,0 +396 @@
+        floor.publish(sid)  # defect: published before the authority accepted the build
@@ -401 +402 @@
-        projection = floor.publish(sid)
+        projection = {}
