proof/VELDO-0036/review-20260923/mutations/reservation-ignore-cleanup.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -273 +273 @@
-            if observation.get('cleaned') is not True:
+            if False:
