proof/VELDO-0049/mutations/floor-review-signature-unchecked.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -913 +913 @@
-    if not _signed_by(conn, reviewer, params["now"], body, signature):
+    if False:  # defect: the receipt's signature is not verified
