proof/VELDO-0036/review-20260923/mutations/reservation-parent-exit-releases-slot.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -271 +271 @@
-            if observation.get('terminated') is not True:
+            if False:
