proof/VELDO-0049/mutations/floor-status-guard-removed.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -290,2 +290 @@
-        if self._authority is not None or EL.enrolled(self.repo_root):
-            raise EL.Stopped("status_projection_owned")
+        pass  # defect: an enrolled unit's status is written here
