proof/VELDO-0039/mutations/dispatch-acceptance-without-recheck.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -383 +383 @@
-            refusal = self._recheck(contract)
+            refusal = None  # defect: the accepting boundary does not recheck the station decision
