proof/VELDO-0054/mutations/settlement-signature-type-unchecked.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -259 +259 @@
-    for name in ('signature', 'signer'):
+    for name in ('signer',):
