proof/VELDO-0039/mutations/dispatch-ended-state-ignored.diff
--- a/.veldo/control_dispatch.py
+++ b/.veldo/control_dispatch.py
@@ -338 +338 @@
-    if record['state'] not in allowed or params.get('expected_state') not in (None, record['state']):
+    if record['state'] not in allowed:  # defect: the state an observation ends is not checked
