proof/VELDO-0054/mutations/unsigned-settlement-accepted.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -274 +274,4 @@
-        if verify is None or not isinstance(body, dict) or not _is_str(signature) or not _is_str(signer):
+        if isinstance(body, dict) and not _is_str(signature):
+            verified.append(body)
+            continue
+        if verify is None or not isinstance(body, dict) or not _is_str(signer):
