proof/VELDO-0057/mutations/landing-authority-generation-unread.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -350 +350 @@
-        elif authority['data'].get('generation') != self.generation:
+        elif False:  # defect: a superseded authority generation is current
