proof/VELDO-0134/mutations/architecture-signature-unverified.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -347 +347 @@
-        if not verified:
+        if False:  # defect: the verdict is ignored
