proof/VELDO-0039/mutations/dispatch-lost-answer-as-refused.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -266,2 +266,2 @@
-            record = self.dispatches.unknown(self.dispatch_id, digest, 'launch_evidence_missing', now=self.clock(),
-                                             expected_state='accepted')
+            record = self.dispatches.refuse(self.dispatch_id, digest, 'launch_evidence_missing', now=self.clock(),
+                                            expected_state='accepted')
