proof/VELDO-0039/mutations/dispatch-new-dispatch-for-unknown.diff
--- a/.veldo/control_dispatch.py
+++ b/.veldo/control_dispatch.py
@@ -100 +100 @@
-HOLDING = ('prepared', 'accepted', 'running', 'unknown')
+HOLDING = ('prepared', 'accepted', 'running')  # defect: an unknown outcome frees its unit
