proof/VELDO-0039/mutations/dispatch-receiver-identity-recorded.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -388 +388 @@
-            process = process_identity(worker.pid)
+            process = process_identity(os.getpid())  # defect: the receiver's own identity
