proof/VELDO-0039/mutations/dispatch-receiver-takes-unprepared.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -370 +370 @@
-        if record is None or record['state'] != 'prepared':
+        if record is None or record['state'] not in ('prepared', 'unknown', 'exited'):  # defect
