proof/VELDO-0039/mutations/dispatch-refusal-not-observed.diff
--- a/.veldo/control_dispatch.py
+++ b/.veldo/control_dispatch.py
@@ -470 +470 @@
-            self.observe(dict(event, outcome='refused', refusal=error.code, taxonomy=taxonomy(error.code)))
+            pass  # defect: a refusal is not observed
