proof/VELDO-0039/mutations/dispatch-spawn-before-acceptance.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -387,0 +388 @@
+        spawned = self._spawn(dispatch_id, self.dispatches.receipt(dispatch_id, 'accept'), adapter)  # defect
@@ -398 +399 @@
-            worker = self._spawn(dispatch_id, acceptance, adapter)
+            worker = spawned
