proof/VELDO-0039/mutations/dispatch-spawn-failure-as-unknown.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -384 +384 @@
-            self.dispatches.refuse(dispatch_id, contract_digest, refusal, now=time.time())
+            self.dispatches.unknown(dispatch_id, contract_digest, refusal, now=time.time())
