proof/VELDO-0039/mutations/dispatch-stopped-not-reported.diff
--- a/.veldo/control_dispatch.py
+++ b/.veldo/control_dispatch.py
@@ -436 +436 @@
-                    stopped=sorted(d for d, s in states.items() if s == 'unknown'),
+                    stopped=sorted(d for d, s in states.items() if s == 'refused'),
