proof/VELDO-0039/mutations/dispatch-unknown-after-exit.diff
--- a/.veldo/control_dispatch.py
+++ b/.veldo/control_dispatch.py
@@ -97 +97 @@
-    'unknown': (('accepted', 'running'), 'unknown'),
+    'unknown': (('accepted', 'running', 'exited'), 'unknown'),  # defect: an ended dispatch reopens
