proof/VELDO-0039/mutations/dispatch-unknown-frees-unit.diff
--- a/.veldo/control_dispatch.py
+++ b/.veldo/control_dispatch.py
@@ -373 +373 @@
-    if target not in HOLDING:
+    if target not in HOLDING or target == 'unknown':  # defect: an unknown outcome releases its unit
