proof/VELDO-0040/mutations/containment-concurrency-uncounted.diff
--- a/.veldo/control_containment.py
+++ b/.veldo/control_containment.py
@@ -393 +393 @@
-            if len(live) >= self.settings['concurrency']:
+            if False:  # defect: the live groups are not held to the concurrency cap
