proof/VELDO-0040/mutations/containment-kill-without-grace.diff
--- a/.veldo/control_containment.py
+++ b/.veldo/control_containment.py
@@ -524 +524 @@
-        self.group, self.pid, self.grace = group, pid, {'cooperative': stop_grace, 'terminate': kill_grace,
+        self.group, self.pid, self.grace = group, pid, {'cooperative': stop_grace, 'terminate': 0,
