proof/VELDO-0040/mutations/containment-kind-unchecked.diff
--- a/.veldo/control_containment.py
+++ b/.veldo/control_containment.py
@@ -228,2 +227,0 @@
-    if not problems and profile['kind'] != LINUX:
-        problems.append('unavailable_service:profile:kind')
