proof/VELDO-0040/mutations/containment-retire-without-looking.diff
--- a/.veldo/control_containment.py
+++ b/.veldo/control_containment.py
@@ -590 +590 @@
-    return {'terminated': process is None or not alive(process), 'cleaned': observed != 'populated',
+    return {'terminated': process is None or not alive(process), 'cleaned': True,  # defect
