proof/VELDO-0041/mutations/heartbeat-after-model-return.diff
--- a/.veldo/control_heartbeat.py
+++ b/.veldo/control_heartbeat.py
@@ -118,0 +119 @@
+        poller.poll()  # defect: the heartbeat waits for the engine's model call to return
