proof/VELDO-0041/mutations/heartbeat-channel-left-to-engine.diff
--- a/.veldo/control_heartbeat.py
+++ b/.veldo/control_heartbeat.py
@@ -102,2 +102 @@
-        os.close(engine)
-        os.close(fd)
+        os.close(engine)  # defect: the channel stays open into the engine
