proof/VELDO-0041/mutations/heartbeat-configured-interval-ignored.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -630 +630 @@
-                   '--heartbeat', str(beat), repr(float(interval))] + argv
+                   '--heartbeat', str(beat), repr(float(C.SETTINGS['heartbeat_seconds']['default']))] + argv  # defect: the wrapper beats at the shipped interval, not the configured one
