proof/VELDO-0041/mutations/heartbeat-default-window.diff
--- a/.veldo/control_containment.py
+++ b/.veldo/control_containment.py
@@ -110 +110 @@
-    'heartbeat_window_seconds': dict(required=False, kind='seconds', default=30, controls=[],
+    'heartbeat_window_seconds': dict(required=False, kind='seconds', default=60, controls=[],  # defect
