proof/VELDO-0041/mutations/heartbeat-renewal-skipped.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -717 +717 @@
-        renewed, refusal = self.renewals.renew(contract, contract_digest, process, beat['seq'], time.time())
+        renewed, refusal = None, None  # defect: a heartbeat does not renew the claim
