proof/VELDO-0041/mutations/heartbeat-window-from-first.diff
--- a/.veldo/control_heartbeat.py
+++ b/.veldo/control_heartbeat.py
@@ -155 +155 @@
-        return (self.last if self.last is not None else self.released) + self.window
+        return (self.first if self.first is not None else self.released) + self.window  # defect
