proof/VELDO-0041/mutations/retire-before-descendant-termination.diff
--- a/.veldo/control_retirement.py
+++ b/.veldo/control_retirement.py
@@ -202 +202 @@
-        kernel = C.retirement(entry['group'], record.get('process'))
+        kernel = C.retirement(None, record.get('process'))  # defect: only the worker is looked at
