proof/VELDO-0041/mutations/retire-clone-group-unrecorded.diff
--- a/.veldo/control_retirement.py
+++ b/.veldo/control_retirement.py
@@ -226 +226 @@
-                self.clones.record_group(dispatch_id, {k: entry['group'].get(k) for k in ('unit', 'slice', 'cgroup')})
+                pass  # defect: the receiver's group is not recorded on the clone's user
