proof/VELDO-0041/mutations/retire-on-first-observation.diff
--- a/.veldo/control_retirement.py
+++ b/.veldo/control_retirement.py
@@ -288 +288 @@
-            seen = self._observe(dispatch_id, entry)
+            seen = entry.setdefault('first_seen', self._observe(dispatch_id, entry))  # defect: stale
