proof/VELDO-0041/mutations/retire-pending-call-settled.diff
--- a/.veldo/control_reservations.py
+++ b/.veldo/control_reservations.py
@@ -279 +279 @@
-            if any(r['state'] not in ('settled', 'unknown') for r in calls):
+            if any(r['state'] not in ('settled', 'unknown', 'pending') for r in calls):  # defect
