proof/VELDO-0041/mutations/retire-pending-unlisted.diff
--- a/.veldo/control_retirement.py
+++ b/.veldo/control_retirement.py
@@ -392 +392 @@
-            if slot is not None and not slot.get('retired'):
+            if False:  # defect: a held slot is not listed as pending
