proof/VELDO-0041/mutations/retire-refusal-unclassified.diff
--- a/.veldo/control_retirement.py
+++ b/.veldo/control_retirement.py
@@ -379 +379 @@
-        self.observations.append(dict(event, outcome='refused', refusal=code, taxonomy=taxonomy(code),
+        self.observations.append(dict(event, outcome='refused', refusal=code, taxonomy=None,
