proof/VELDO-0041/mutations/retire-unknown-outcome-conclusive.diff
--- a/.veldo/control_retirement.py
+++ b/.veldo/control_retirement.py
@@ -93 +93 @@
-CONCLUSIVE = ('prepared', 'exited', 'refused')
+CONCLUSIVE = ('prepared', 'exited', 'refused', 'unknown')  # defect
