proof/VELDO-0041/mutations/stop-configured-graces-ignored.diff
--- a/.veldo/control_launch.py
+++ b/.veldo/control_launch.py
@@ -691 +691 @@
-        return self._settings('stop_grace_seconds', 'kill_grace_seconds')
+        return tuple(C.SETTINGS[n]['default'] for n in ('stop_grace_seconds', 'kill_grace_seconds'))  # defect
