proof/VELDO-0045/mutations/runtime-installed-set-unchecked.diff
--- a/.veldo/control_runtime.py
+++ b/.veldo/control_runtime.py
@@ -316,2 +316 @@
-            problems.append('missing_dependency:' + name)
-            continue
+            continue  # defect: a locked distribution may be absent
