proof/VELDO-0045/mutations/runtime-missing-asset-unnamed.diff
--- a/.veldo/control_runtime.py
+++ b/.veldo/control_runtime.py
@@ -372 +372 @@
-    missing = ['missing_asset:.veldo/' + rel for rel in JOURNEY if not _asset(rel).is_file()]
+    missing = []  # defect: an omitted asset is found by whatever reads it first
