proof/VELDO-0045/mutations/runtime-qualification-without-result.diff
--- a/.veldo/control_runtime.py
+++ b/.veldo/control_runtime.py
@@ -426 +426 @@
-                                             answers['suspend'].get('resume'), supplied)
+                                             answers['suspend'].get('resume'), [])  # defect: the cycle advances without its supplied result
