proof/VELDO-0045/mutations/runtime-records-source-fallback.diff
--- a/.veldo/control_runtime.py
+++ b/.veldo/control_runtime.py
@@ -192 +192 @@
-    return HERE / rel
+    return HERE / rel if (HERE / rel).is_file() else Path.cwd() / 'engine' / rel  # defect: the source tree
