proof/VELDO-0047/mutations/authority-closure-ignores-loader-helpers.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -311 +311,2 @@
-            if not options:
+            if True:  # defect: what a loader helper loads (organ('x')) is not followed
+                accounted.add(id(target))
