proof/VELDO-0047/mutations/authority-closure-ignores-loader-helpers.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -268 +268 @@
-            if not candidates:
+            if True:  # defect: what a loader helper loads (organ('x')) is not followed
