proof/VELDO-0047/mutations/authority-closure-omits-the-validator.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -356 +356 @@
-    seeds = set(ENTRY_POINTS) | {name for _role, name in EL.VALIDATOR_ROLES}
+    seeds = set(ENTRY_POINTS)  # defect: the validator the receiver's recheck runs is not installed
