proof/VELDO-0047/mutations/authority-command-coordinates-unchecked.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -872,2 +872 @@
-        if any(command.get(k) != v for k, v in expected.items()):
-            raise Refused('invalid_input:coordinates', 'the command names another domain, store or repository')
+        pass  # defect: the command's own coordinates are not compared
