proof/VELDO-0047/mutations/authority-key-guidance-changes-the-mode.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -484 +484 @@
-        return 'it is open to others; a key directory is one of its own, so ' + elsewhere
+        return 'close it to everyone else: chmod 0700 %s' % path  # defect: the guidance changes an existing directory
