proof/VELDO-0047/mutations/authority-key-guidance-includes-the-ancestor.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -408 +408 @@
-    return list(reversed(missing))
+    return list(reversed(missing + [current]))  # defect: the first existing ancestor is named too
