proof/VELDO-0047/mutations/authority-key-placement-link-followed.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -383 +383 @@
-    keys = os.path.abspath(str(key_directory)) if key_directory else os.path.join(DEFAULT_KEY_ROOT, service)
+    keys = os.path.realpath(str(key_directory)) if key_directory else os.path.join(DEFAULT_KEY_ROOT, service)
