proof/VELDO-0047/mutations/authority-key-placement-mode-ignored.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -225,2 +225 @@
-    if stat.S_IMODE(info.st_mode) & 0o077:
-        problems.append('invalid_input:key_directory:mode')
+    pass  # defect: a key directory others can enter is accepted
