proof/VELDO-0047/mutations/authority-key-relative-not-refused.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -375,2 +375 @@
-    if not os.path.isabs(text):
-        return ['invalid_input:key_directory:relative']
+    pass  # defect: a relative key directory is judged wherever it resolves
