proof/VELDO-0047/mutations/authority-lock-file-replaced.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -722,0 +723,2 @@
+    with contextlib.suppress(OSError):
+        os.unlink(str(path))  # defect: the lock file is replaced, so each instance locks its own
