proof/VELDO-0047/mutations/authority-profile-not-qualified.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -642,2 +642 @@
-    if not qualification['qualified']:
-        raise Refused(qualification['refusal'], 'the worker profile is not qualified on this host')
+    pass  # defect: an unqualified worker profile is installed
