proof/VELDO-0047/mutations/authority-receiver-profile-omitted.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -691 +691 @@
-                                'profile': profile, 'adapters': adapters}), 0o600)
+                                'adapters': adapters}), 0o600)  # defect: the receiver gets no worker profile
