proof/VELDO-0047/mutations/authority-refusal-not-observed.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -663 +663,2 @@
-        self._count(observation)
+        if ok:  # defect: a refused command leaves no observation
+            self._count(observation)
