proof/VELDO-0047/mutations/authority-request-refusal-not-observed.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -971 +971 @@
-        if isinstance(response, dict) and response.get('accepted') is False:
+        if False:  # defect: a request refused before apply leaves no observation
