proof/VELDO-0047/mutations/authority-runs-the-source-copy.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -664 +664 @@
-              'PYTHON': python, 'EXECUTABLE': os.path.join(bin_dir, 'control_service.py'), 'CONFIG': config_path}
+              'PYTHON': python, 'EXECUTABLE': str(HERE / 'control_service.py'), 'CONFIG': config_path}  # defect: the unit runs the source copy
