proof/VELDO-0047/mutations/authority-serves-another-store.diff
--- a/.veldo/control_service.py
+++ b/.veldo/control_service.py
@@ -746 +746 @@
-        conn = S.open_store(config['store_path'])
+        conn = S.open_store(config['store_path'] + '-local')  # defect: the service keeps a store of its own
