proof/VELDO-0049/mutations/floor-any-member-disposes.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -1011 +1011 @@
-    if builder or member is None or (member.get("principal_type") != "person" and by != finding["raised_by"]):
+    if member is None:  # defect: any member, the builder included, disposes a finding
