proof/VELDO-0049/mutations/floor-dispatcher-establishes-completion.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -502,0 +503,7 @@
+        receipt = "receipt:revision_landed:" + sid  # defect: the dispatcher records the landing itself
+        floor.store.execute(floor.conn, dict(
+            command_id="landed/" + sid, principal=floor.principal, operation="upsert_entity",
+            nonce="landed/" + sid, artifact_digests=[], expected_versions={receipt: 0},
+            parameters=dict(entity_id=receipt, kind="completion_receipt",
+                            data={"fact": "revision_landed", "subject": {"id": sid, "revision": 1}})),
+            floor.signer, floor.sign, floor.generation)
