proof/VELDO-0049/mutations/floor-earlier-builder-reviews.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -886 +886 @@
-    if reviewer in (record.get("builders") or [record["builder"]]):
+    if reviewer == record["builder"]:  # defect: only the latest attempt's builder is refused
@@ -952 +952 @@
-    if reviewer in (record.get("builders") or [record["builder"]]):
+    if reviewer == record["builder"]:  # defect: only the latest attempt's builder is refused
