proof/VELDO-0049/mutations/floor-findings-forgotten-on-rebuild.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -1036 +1036,2 @@
-    unresolved = sorted(fid for fid, f in record["findings"].items() if not f.get("resolved"))
+    unresolved = sorted(fid for fid, f in record["findings"].items() if not f.get("resolved")
+                        and f.get("attempt") == attempt)  # defect: a rebuild forgets earlier findings
