proof/VELDO-0049/mutations/floor-gate-not-required.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -808 +808 @@
-    if not isinstance(gate, dict) or gate.get("green") is not True:
+    if False:  # defect: the gate's answer is not required
