proof/VELDO-0049/mutations/floor-handoff-completes.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -1043 +1043 @@
-    record["state"] = "handoff"
+    record["state"] = "completed"  # defect: the handoff establishes completion
