proof/VELDO-0049/mutations/floor-handoff-completes.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -990 +990 @@
-    record["state"] = "handoff"
+    record["state"] = "completed"  # defect: the handoff establishes completion
