proof/VELDO-0049/mutations/floor-handoff-ignores-findings.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -1040 +1040 @@
-    codes.extend("unresolved_finding:" + fid for fid in unresolved)
+    codes.extend([])  # defect: an open finding does not block the handoff
