proof/VELDO-0049/mutations/floor-land-retry-reassigns.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -462 +462 @@
-        if (floor.record(sid) or {}).get("state") == "handoff":
+        if False:  # defect: a failed land is not retried from its handoff
