proof/VELDO-0049/mutations/floor-land-without-handoff.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -506 +506 @@
-            if state != "handoff":
+            if False:  # defect: an enrolled unit lands without its handoff
