proof/VELDO-0049/mutations/floor-pass-erases-finding.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -922 +922 @@
-    findings = dict(record["findings"])
+    findings = {} if verdict_passes(body) else dict(record["findings"])  # defect: a pass discards findings
