proof/VELDO-0049/mutations/floor-policy-count-ignored.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -1038 +1038 @@
-    if len(passing) < need:
+    if len(passing) < 1:  # defect: one review hands off whatever the policy requires
