proof/VELDO-0049/mutations/floor-proof-not-judged.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -836 +836 @@
-    problems = proof_problems(manifest, unit)
+    problems = []  # defect: the proof is not judged
