proof/VELDO-0049/mutations/floor-rejected-ruling-resolves.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -968 +968 @@
-    if body["ruling"] == "resolved":
+    if body["ruling"] in RULINGS:  # defect: a rejected ruling resolves the finding
