proof/VELDO-0049/mutations/floor-review-context-unbound.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -895 +895 @@
-    if given.get("payload") != payload:
+    if False:  # defect: the reviewer may be launched with more than its assignment
