proof/VELDO-0049/mutations/floor-review-dispatch-source-unbound.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -898 +898 @@
-    if (contract.get("source") or {}).get("commit") != record["source"]["commit"]:
+    if False:  # defect: the reviewer may be launched at another commit
