proof/VELDO-0049/mutations/floor-review-output-unbound.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -937 +937 @@
-    if (dispatch.get("termination") or {}).get("output_digest") != _digest(printed):
+    if False:  # defect: the receipt need not be what the review dispatch printed
