proof/VELDO-0049/mutations/floor-review-proof-unbound.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -917 +917 @@
-    if body.get("proof") != record["proof"]["digest"]:
+    if False:  # defect: the receipt may review another proof
