proof/VELDO-0049/mutations/floor-tracker-enrollment-unread.diff
--- a/.veldo/tracker_bridge.py
+++ b/.veldo/tracker_bridge.py
@@ -479 +479 @@
-        return self._EL.enrolled(root)
+        return False  # defect: the repository's enrollment is not asked
