proof/VELDO-0049/mutations/floor-tracker-enrollment-unread.diff
--- a/.veldo/tracker_bridge.py
+++ b/.veldo/tracker_bridge.py
@@ -482 +482 @@
-        return self._EL.enrolled(str(root))
+        return False  # defect: the repository's enrollment is not asked
