proof/VELDO-0049/mutations/floor-tracker-write-unguarded.diff
--- a/.veldo/tracker_bridge.py
+++ b/.veldo/tracker_bridge.py
@@ -256 +256 @@
-        self._refuse_enrolled(repo)
+        # defect: a direct write reaches an enrolled repository
