proof/VELDO-0050/mutations/proof-build-only-lands.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -721,0 +722 @@
+                self.hooks.emit("merge.completed", spec=spec.get("id"), commit=build.get("commit"))  # defect: a landing
