proof/VELDO-0050/mutations/proof-bundle-rewritable.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -521,2 +521 @@
-    if before.get(rid) is not None:
-        raise Refused("proof_immutable", rid)
+    pass  # defect: an accepted bundle may be rewritten
