proof/VELDO-0050/mutations/proof-checks-from-claims.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -475 +475,2 @@
-              "checks": checks, "producer": producer, "builder": builder if _text(builder) else None}
+              "checks": [dict(c) for c in claims if isinstance(c, dict)], "producer": producer,  # defect: the claims recorded as checks
+              "builder": builder if _text(builder) else None}
