proof/VELDO-0050/mutations/proof-criteria-from-manifest.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -408 +408 @@
-    problems.extend("missing_evidence:criteria/omitted:%s" % cid for cid in spec["criteria"] if cid not in ids)
+    problems.extend("missing_evidence:criteria/omitted:%s" % cid for cid in ids if cid not in ids)  # defect: the manifest names its own universe
