proof/VELDO-0050/mutations/proof-default-passed-check.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -325 +325 @@
-            "checks": list((build or {}).get("checks") or []),
+            "checks": list((build or {}).get("checks") or [{"name": "unit", "status": "passed"}]),  # defect: a default passed check
