proof/VELDO-0050/mutations/proof-executor-emits-gate-event.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -692,0 +693,2 @@
+            if gate_green:
+                self.hooks.emit("gate.passed", spec=spec.get("id"), commit=build.get("commit"))  # defect: the gate's own event
