proof/VELDO-0050/mutations/proof-executor-emits-verdict.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -747 +747 @@
-            if gate is None:
+            if True:  # defect: the executor emits verdict.recorded itself
