proof/VELDO-0050/mutations/proof-gate-exit-unrecorded.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -458 +458 @@
-                               "observed": "   %s: pass" % name, "gate_exit": observation.get("exit"),
+                               "observed": "   %s: pass" % name, "gate_exit": None,  # defect: the gate exit is not recorded
