proof/VELDO-0050/mutations/proof-implementation-is-the-built-commit.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -470 +470 @@
-              "implementation": {"commit": implementation}, "spec": spec,
+              "implementation": {"commit": commit}, "spec": spec,  # defect: the built commit named as the implementation
