proof/VELDO-0050/mutations/proof-kept-in-temporary-storage.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -347,6 +347,4 @@
-            try:
-                accepted = self.proofs.accept(sid, commit=commit, base=spec.get("base"), spec_path=spec.get("spec_path"),
-                                              manifest=proof, observation=observation, builder=builder)
-            except CP.Refused as error:
-                return {"ok": False, "problems": list(error.codes), "bundle": None}
-            return dict(accepted, ok=True, problems=[])
+            with tempfile.NamedTemporaryFile("w", suffix=".json", delete=True) as held:
+                held.write(json.dumps(proof))  # defect: the manifest is kept only in temporary validation storage
+                held.flush()
+            return {"ok": True, "problems": [], "bundle": None}
