proof/VELDO-0050/mutations/proof-observation-digest-unbound.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -539 +539 @@
-    elif stored["digest"] != reference.get("digest"):
+    elif False:  # defect: an altered observation reference is believed
