proof/VELDO-0050/mutations/proof-refusal-not-observed.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -594,2 +594 @@
-            self.observe(dict(event, outcome="refused", refusal=error.code, refusals=codes,
-                              taxonomy=taxonomy(error.code)))
+            pass  # defect: a refusal is not observed
