proof/VELDO-0050/mutations/proof-spec-revision-unread.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -370 +370 @@
-    if manifest.get("spec_revision") != spec["revision"]:
+    if False:  # defect: the proof's spec revision is not compared with the accepted one
