proof/VELDO-0050/mutations/proof-terminal-not-required.diff
--- a/.veldo/control_proof.py
+++ b/.veldo/control_proof.py
@@ -441,2 +441 @@
-        if terminal != "GATE: GREEN (%s)" % commit:
-            problems.append("missing_evidence:observation/terminal")
+        pass  # defect: a gate that printed no terminal result is not refused for it
