proof/VELDO-0051/mutations/projection-skips-committed-event.diff
--- a/.veldo/control_event_projection.py
+++ b/.veldo/control_event_projection.py
@@ -293 +293 @@
-            fresh = [e for e in events if e['id'] not in present]
+            fresh = [e for e in events if e['id'] not in present][1:]  # defect: a committed event is skipped
