proof/VELDO-0051/mutations/projection-unknown-taxonomy-classified.diff
--- a/.veldo/control_event_projection.py
+++ b/.veldo/control_event_projection.py
@@ -88 +88 @@
-    return head if head in TAXONOMY else 'unknown_outcome'
+    return head if head in TAXONOMY else 'missing_evidence'  # defect: an unknown code is classified
