proof/VELDO-0051/mutations/spend-records-as-spec-shipped.diff
--- a/.veldo/spend.py
+++ b/.veldo/spend.py
@@ -44 +44 @@
-SCHEMA_EVENT_TYPE = "spend.recorded"
+SCHEMA_EVENT_TYPE = "spec.shipped"  # defect: a spend record is written as completion
