proof/VELDO-0051/mutations/vocabulary-spec-shipped-hand-owned.diff
--- a/.veldo/control_event_vocabulary.py
+++ b/.veldo/control_event_vocabulary.py
@@ -57 +57 @@
-    "spec.shipped": JOURNAL_PROJECTION,
+    "spec.shipped": HAND,  # defect: completion is registered as a hand emission
