proof/VELDO-0052/mutations/completion-any-revision-lands.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -227 +227 @@
-            if CC.fact_problems('revision_landed', r, subject):
+            if CC.fact_problems('revision_landed', r, None):
