proof/VELDO-0052/mutations/completion-frontier-reads-status-text.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -192 +192 @@
-    status = EL.completion_status(EL.gate_for(repo_root or ROOT, eligibility), _status_map(idx))
+    status = _status_map(idx)
