proof/VELDO-0052/mutations/dispatch-identity-not-reserved.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -677,2 +677 @@
-                self._reservations().reserve_worker('worker/' + dispatch, dispatch, self.account, project, unit,
-                                                    now=self.clock())
+                pass  # defect: an identity no worker slot was reserved for
