proof/VELDO-0052/mutations/eligibility-enrolled-default-runs.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -210 +210 @@
-        raise Stopped('eligibility_required')
+        return None
