proof/VELDO-0052/mutations/eligibility-ignores-scope.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -522 +522 @@
-            return [] if a.get('scope_digest') == data.get('scope_digest') and a.get('scope_digest') else ['stale_scope']
+            return []
