proof/VELDO-0052/mutations/eligibility-plan-bypass.diff
--- a/.veldo/plan.py
+++ b/.veldo/plan.py
@@ -323 +323 @@
-        reasons.extend("eligibility refused: %s" % r for r in decision["refusals"])
+        pass  # defect: the direct-execution refusals are dropped
