proof/VELDO-0052/mutations/eligibility-refusals-not-pending.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -447 +447 @@
-        self.last[decision['unit']] = outcome
+        self.last[decision['unit']] = 'accepted'
