proof/VELDO-0052/mutations/eligibility-review-as-provider-request.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -307 +307 @@
-            decision = gate.decide("review", sid, context=context, ticket=unit.get("eligibility"))
+            decision = gate.decide("provider_request", sid, context=context, ticket=unit.get("eligibility"))
