proof/VELDO-0052/mutations/eligibility-review-bypass.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -303,3 +303 @@
-            decision = gate.decide("review", sid, context=context, ticket=unit.get("eligibility"))
-            if not decision["eligible"]:
-                return self._refused("review", sid, decision, verdict=None, shipped=False, landed=False)
+            pass  # defect: direct review launches without the shared review decision
