proof/VELDO-0052/mutations/eligibility-status-only-recheck.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -383 +383 @@
-        for label in sorted(set(before) | set(accepted)):
+        for label in ['unit']:  # defect: only the unit's own record, its current status
