proof/VELDO-0052/mutations/eligibility-work-no-preclaim-decision.diff
--- a/.veldo/work.py
+++ b/.veldo/work.py
@@ -130,2 +129,0 @@
-            if gate is not None and not gate.decide("claim", u["spec"], ticket=u.get("eligibility"))["eligible"]:
-                continue
