proof/VELDO-0052/mutations/enrolled-git-error-reads-unenrolled.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -197,3 +197 @@
-        if _claims_a_repository(repo_root):
-            raise Stopped('enrollment_unanswerable') from error
-        return False
+        return False  # defect: any git error reads as not enrolled
