proof/VELDO-0052/mutations/entry-gate-not-built.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -321 +321 @@
-    return enrolled_gate(repo_root, trust, observe=observe)
+    raise Stopped('eligibility_required')  # defect: the production entries build no Gate
