proof/VELDO-0052/mutations/executor-decides-once.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -535 +535 @@
-            current = self._decide(gate, sid, launch, decision)
+            current = decision if launch == "build" else self._decide(gate, sid, launch, decision)  # defect
