proof/VELDO-0052/mutations/executor-recheck-without-ticket.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -535 +535 @@
-            current = self._decide(gate, sid, launch, decision)
+            current = self._decide(gate, sid, launch, None)  # defect: the recheck forgets what it consumed
