proof/VELDO-0052/mutations/executor-review-skips-review-station.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -402,2 +402 @@
-            context = dict(self.context, reviewer=getattr(self.hooks, "reviewer_identity", None))
-            return gate.decide("review", sid, context=context, ticket=ticket)
+            return gate.decide("direct_execution", sid, context=self.context, ticket=ticket)  # defect
