proof/VELDO-0052/mutations/launch-call-boundary-first-cycle-only.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -536 +536 @@
-            if current["eligible"]:
+            if current["eligible"] and cycle == 1:  # defect
