proof/VELDO-0052/mutations/launch-skips-call-boundary.diff
--- a/.veldo/executor.py
+++ b/.veldo/executor.py
@@ -536 +536 @@
-            if current["eligible"]:
+            if False:  # defect: the builder is entered whatever its calls will be told
