proof/VELDO-0052/mutations/reservation-refusal-fails-open.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -726 +726,2 @@
-                raise named from error
+                guard.launch(invocation, configuration)  # defect: a refused reservation still launches
+                receipt = {'replayed': False}
