proof/VELDO-0052/mutations/reservation-retry-bypass.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -494 +494,5 @@
-                receipt = guard.invoke(command_id or 'call/' + invocation, self.dispatch, invocation, boundary,
+                if boundary == 'retry':
+                    guard.launch(invocation, configuration)  # defect: retries skip the reservation
+                    receipt = {'replayed': False}
+                else:
+                  receipt = guard.invoke(command_id or 'call/' + invocation, self.dispatch, invocation, boundary,
