proof/VELDO-0052/mutations/reservation-review-follow-on-bypass.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -809 +809,5 @@
-                receipt = guard.invoke(command_id or 'call/' + invocation, self.dispatch, invocation, boundary,
+                if self.station == 'review' and boundary == 'follow_on':
+                    guard.launch(invocation, configuration)  # defect: no reservation
+                    receipt = {'replayed': False}
+                else:
+                  receipt = guard.invoke(command_id or 'call/' + invocation, self.dispatch, invocation, boundary,
