proof/VELDO-0052/mutations/review-lane-reads-front-matter.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -328 +328 @@
-        if _lane_status(fm, status) == "review":
+        if fm.get("status") == "review":
