proof/VELDO-0052/mutations/slot-kept-after-launch-returns.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -755 +755 @@
-        self.close_dispatch(dispatch, 'completed')
+        # defect: a launch that returned normally keeps its worker slot
