proof/VELDO-0052/mutations/slot-opened-before-prelaunch-halts.diff
--- a/.veldo/dispatch.py
+++ b/.veldo/dispatch.py
@@ -273,0 +274 @@
+            self._calls.open_dispatch(sid, context=context)  # defect: reserved before the halts, never retired
