proof/VELDO-0052/mutations/status-reader-drops-the-stop.diff
--- a/.veldo/runstatus.py
+++ b/.veldo/runstatus.py
@@ -226 +226 @@
-        return [], stop.reason
+        return [], None  # defect: the stop reads as an empty burn-down
