proof/VELDO-0052/mutations/trust-judges-unresolved-path.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -259 +259 @@
-        resolved = os.path.realpath(self.enrollment_signers)
+        resolved = os.path.abspath(self.enrollment_signers)  # defect: symlinks not followed
