proof/VELDO-0053/mutations/architecture-accepted-digest-ignored.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -880 +880 @@
-        elif accepted and parsed != accepted['digest']:
+        elif False:  # defect: whatever bytes are at the path are the accepted architecture
