proof/VELDO-0053/mutations/architecture-accepted-digest-ignored.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -770 +770 @@
-        elif accepted and found['artifact']['digest'] != accepted['digest']:
+        elif False:  # defect: whatever bytes are at the path are the accepted architecture
