proof/VELDO-0053/mutations/architecture-clone-validator.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -750 +750 @@
-            self._validator = ValidatorSnapshot()
+            self._validator = ValidatorSnapshot(os.path.join(self.workspace, '.veldo'))  # defect: the workspace's own validator judges the workspace
