proof/VELDO-0053/mutations/architecture-digest-second-read.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -840 +840 @@
-        elif accepted and parsed != accepted['digest']:
+        elif accepted and 'sha256:' + hashlib.sha256(Path(load.path).read_bytes()).hexdigest() != accepted['digest']:  # defect: a second read
