proof/VELDO-0053/mutations/architecture-exec-rereads-disk.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -424 +424 @@
-        exec(compile(self.body, key, 'exec', dont_inherit=True), module.__dict__)
+        exec(compile(Path(module.__spec__.origin).read_bytes(), key, 'exec', dont_inherit=True), module.__dict__)  # defect: compiled from a second read of the disk
