proof/VELDO-0053/mutations/architecture-get-source-missing.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -416 +416 @@
-        return importlib.util.decode_source(self.body)
+        return None  # defect: the loader hands back no source
