proof/VELDO-0053/mutations/architecture-identity-from-workspace.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -814 +814,3 @@
-            found['validator'] = {role: dict(entry) for role, entry in snapshot.identity.items()}
+            found['validator'] = {role: {'path': os.path.join(self.workspace, '.veldo', os.path.basename(entry['path'])),
+                                         'digest': entry['digest']}
+                                  for role, entry in snapshot.identity.items()}  # defect: names what the workspace carries
