proof/VELDO-0053/mutations/architecture-identity-not-recorded.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -775 +775 @@
-        if decision.get('architecture'):
+        if False:  # defect: the decision's architecture is not in its observation
