proof/VELDO-0053/mutations/architecture-identity-roles-only.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -506 +506 @@
-                for held, digest in self._executed.items()}
+                for held, digest in self._executed.items() if held in ROLE_LABELS}  # defect: labelled modules only
