proof/VELDO-0053/mutations/architecture-identity-static-five.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -490,2 +490,3 @@
-        return {ROLE_LABELS.get(held, held): {'module': held, 'path': str(self._installed / (held + '.py')), 'digest': digest}
-                for held, digest in self._executed.items()}
+        return {role: {'module': name[:-3], 'path': str(self._installed / name),
+                       'digest': 'sha256:' + hashlib.sha256(self._bodies[name[:-3]]).hexdigest()}
+                for role, name in VALIDATOR_ROLES}  # defect: the hand-written list of five
