proof/VELDO-0053/mutations/architecture-invalid-structure-passes.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -783 +783 @@
-        if load.refused:
+        if load.refused and load.kind != 'invalid_structure':  # defect: only unreadable input refuses
