proof/VELDO-0053/mutations/architecture-linecache-key-shared.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -495 +495 @@
-        return '<veldo validator snapshot %s: %s>' % (self._id, self._installed / (held + '.py'))
+        return '<veldo validator snapshot: %s>' % (self._installed / (held + '.py'))  # defect: one key for every snapshot
