proof/VELDO-0053/mutations/architecture-linecache-keyed-by-path.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -421 +421 @@
-        key = self.snapshot.source_key(self.held)
+        key = str(self.snapshot._installed / (self.held + '.py'))  # defect: the installed path, shared
