proof/VELDO-0053/mutations/architecture-linecache-mtime-checked.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -428 +428 @@
-        linecache.cache[key] = (len(self.body), None, importlib.util.decode_source(self.body).splitlines(True), key)
+        linecache.cache[key] = (len(self.body), os.stat(module.__spec__.origin).st_mtime, importlib.util.decode_source(self.body).splitlines(True), key)  # defect: checkcache drops it after an edit
