proof/VELDO-0053/mutations/architecture-linecache-seeded-after-load.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -426 +425,0 @@
-        linecache.cache[key] = (len(self.body), None, importlib.util.decode_source(self.body).splitlines(True), key)
@@ -430 +429,2 @@
-        exec(compile(self.body, key, 'exec', dont_inherit=True), module.__dict__)
+        exec(compile(self.body, key, 'exec', dont_inherit=True), module.__dict__)  # defect: lines cached only after the module ran
+        linecache.cache[key] = (len(self.body), None, importlib.util.decode_source(self.body).splitlines(True), key)
