proof/VELDO-0053/mutations/architecture-linecache-seeded-for-roles-only.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -428 +428,2 @@
-        linecache.cache[key] = (len(self.body), None, importlib.util.decode_source(self.body).splitlines(True), key)
+        if self.held in ROLE_LABELS:  # defect: only the labelled modules' lines are cached
+            linecache.cache[key] = (len(self.body), None, importlib.util.decode_source(self.body).splitlines(True), key)
