proof/VELDO-0053/mutations/architecture-linecache-unseeded.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -422 +422 @@
-        linecache.cache[key] = (len(self.body), None, importlib.util.decode_source(self.body).splitlines(True), key)
+        pass  # defect: linecache reads the file on disk by name
