proof/VELDO-0053/mutations/architecture-loader-malformed-as-absence.diff
--- a/.veldo/contract_loader.py
+++ b/.veldo/contract_loader.py
@@ -123,0 +124,2 @@
+        if kind == "parse_failure":  # defect: the shared loader reads malformed as absence
+            return ContractLoad(CONTRACT_ABSENT, "optional_absence", None, None, (), str(p), False)
