proof/VELDO-0053/mutations/architecture-loader-wrong-type-as-absence.diff
--- a/.veldo/contract_loader.py
+++ b/.veldo/contract_loader.py
@@ -108,0 +109 @@
+        return ContractLoad(CONTRACT_ABSENT, "optional_absence", None, None, (), str(p), False)  # defect
