proof/VELDO-0053/mutations/architecture-malformed-as-optional-absence.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -819,0 +820,2 @@
+        if load.kind == 'parse_failure':  # defect: a present malformed contract read as optional absence
+            load = load._replace(state='absent', kind='optional_absence', problems=(), required=False)
