proof/VELDO-0053/mutations/architecture-private-seam.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -481 +481 @@
-        return self.validate.entry_contract(workspace, required, arch=self.arch)
+        return self.validate._VC.entry_contract(workspace, required, arch=self.arch)  # defect: around the public name
