proof/VELDO-0053/mutations/architecture-record-not-required.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -829 +829 @@
-            load, parsed = snapshot.contract(self.workspace, True if accepted else None)
+            load, parsed = snapshot.contract(self.workspace, None)  # defect: acceptance no longer makes the contract required
