proof/VELDO-0053/mutations/architecture-review-decision-skips.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -790,0 +791,2 @@
+                    if name == ARCHITECTURE_PREDICATE and station == 'review':
+                        continue  # defect: the review decision never asks the architecture
