proof/VELDO-0053/mutations/architecture-review-skipped.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -105,0 +106 @@
+STATION_PREDICATES['review'] = tuple(p for p in STATION_PREDICATES['review'] if p != ARCHITECTURE_PREDICATE)  # defect: direct review skips the architecture
