proof/VELDO-0053/mutations/architecture-siblings-from-disk.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -474 +474 @@
-        util.spec_from_file_location = self._spec
+        pass  # defect: a sibling loaded by path is read from disk
