proof/VELDO-0053/mutations/architecture-snapshot-blocking-read.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -483 +483 @@
-        self._bodies = {path.name[:-3]: _read_engine_file(path) for path in sorted(installed.glob('*.py')) if path.name[:-3]}
+        self._bodies = {path.name[:-3]: path.read_bytes() for path in sorted(installed.glob('*.py')) if path.name[:-3]}
