proof/VELDO-0053/mutations/architecture-snapshot-file-is-key.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -521 +521 @@
-        spec = importlib.util.spec_from_loader(name, _MemoryLoader(self, held), origin=str(self._installed / (held + '.py')))
+        spec = importlib.util.spec_from_loader(name, _MemoryLoader(self, held), origin=self.source_key(held))  # defect: __file__ is the snapshot's cache key, not the installed path
