proof/VELDO-0053/mutations/architecture-snapshot-file-resolved.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -521 +521 @@
-        spec = importlib.util.spec_from_loader(name, _MemoryLoader(self, held), origin=str(self._installed / (held + '.py')))
+        spec = importlib.util.spec_from_loader(name, _MemoryLoader(self, held), origin=os.path.realpath(str(self._installed / (held + '.py'))))  # defect: the link's target
