proof/VELDO-0053/mutations/architecture-snapshot-length-unjudged.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -456 +456 @@
-    if len(body) > ENGINE_FILE_LIMIT:
+    if False:  # defect: a file over the limit is held
