proof/VELDO-0053/mutations/architecture-snapshot-per-decision.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -828 +828 @@
-        if self._validator is None:
+        if True:  # defect: a new snapshot for every decision
