proof/VELDO-0053/mutations/architecture-snapshot-read-limit-short.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -455 +455 @@
-        body = handle.read(ENGINE_FILE_LIMIT + 1)
+        body = handle.read(ENGINE_FILE_LIMIT)  # defect: a longer file is cut to the limit and held
