proof/VELDO-0053/mutations/architecture-snapshot-reads-any-file.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -442 +442 @@
-        if not stat.S_ISREG(os.fstat(handle.fileno()).st_mode):
+        if False:  # defect: a FIFO or other non-regular file is read like a file
