proof/VELDO-0053/mutations/architecture-snapshot-request-any-suffix.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -529 +529 @@
-        return self._named(name, file_name[:-3] if file_name.endswith('.py') else '')
+        return self._named(name, os.path.splitext(file_name)[0])  # defect: any suffix names a held module
