proof/VELDO-0053/mutations/architecture-stop-error-unrecorded.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -792 +792 @@
-            if found.get('error'):
+            if False:  # defect: the stop event does not name its error
