proof/VELDO-0053/mutations/architecture-store-only-passes.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -825 +825,2 @@
-            found['refusals'] = ['missing_evidence:architecture/workspace']
+            if accepted:  # defect: without a record a store-only Gate passes
+                found['refusals'] = ['missing_evidence:architecture/workspace']
