proof/VELDO-0053/mutations/architecture-store-only-reads-cwd.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -513 +513 @@
-        self.workspace = str(workspace) if workspace is not None else None
+        self.workspace = str(workspace) if workspace is not None else os.getcwd()  # defect: the process directory
