proof/VELDO-0053/mutations/architecture-unaccepted-record-accepted.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -818 +818 @@
-        if accepted and (not isinstance(record, dict) or record.get('state') != 'accepted'
+        if accepted and (not isinstance(record, dict)
