proof/VELDO-0053/mutations/architecture-validate-checks-direct.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -433 +433 @@
-            spec = importlib.util.spec_from_file_location('eligibility_validator_snapshot', str(engine / 'validate.py'))
+            spec = importlib.util.spec_from_file_location('eligibility_validator_snapshot', str(engine / 'validate_checks.py'))
@@ -436 +436,2 @@
-            self.validate, self.arch = module, module.entry_validator()
+            module.parse_yamlish = module._Y.parse  # defect: around validate.py
+            self.validate, self.arch = module, module._arch_module()
