proof/VELDO-0053/mutations/architecture-validator-reexecuted-per-call.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -518 +518 @@
-        return self.validate.entry_contract(workspace, required, arch=self.arch)
+        return self.validate.entry_contract(workspace, required, arch=_organ('arch'))  # defect: the structural validator re-executed from disk at every call
