proof/VELDO-0054/mutations/ambiguous-settlement-first.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -301,2 +300,0 @@
-    if len(current) > 1:
-        return ['ambiguous_decision:' + rid]
