proof/VELDO-0054/mutations/blockers-hold-a-stop.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -655,2 +654,0 @@
-        except Stopped:
-            raise  # a named stop is the caller's, never a unit hold
