proof/VELDO-0054/mutations/blockers-raise-unexpected.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -649,2 +648,0 @@
-        except Exception as error:  # noqa: BLE001 - VELDO-0054: an unexpected fault is named, never raised
-            codes = [unexpected(error)]
