proof/VELDO-0054/mutations/blockers-store-refusal-renamed.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -652 +652 @@
-            codes = [self.refusal_code(error)]
+            codes = ['invalid_input:' + error.code]
