proof/VELDO-0054/mutations/blocks-string-not-split.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -158 +158 @@
-        ids.update(text.replace(',', ' ').split())
+        pass
