proof/VELDO-0054/mutations/decide-holds-a-stop.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -799,2 +798,0 @@
-        except Stopped:
-            raise  # a named stop is the caller's, never a unit hold
