proof/VELDO-0054/mutations/floor-stations-skip-decisions.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -697 +697 @@
-            return self._decision_codes(unit, inputs)
+            return []
