proof/VELDO-0054/mutations/framing-receipt-without-digest.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -279 +279 @@
-    if not _is_str(framing) or framing != record.get('framing_digest'):
+    if framing is not None and framing != record.get('framing_digest'):
