proof/VELDO-0054/mutations/framing-shape-only.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -189 +189 @@
-    if not _is_str(framing) or framing != record.get('framing_digest'):
+    if not _is_str(framing):
