proof/VELDO-0054/mutations/invalid-after-unresolved.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -320,0 +321,6 @@
+    mine = [(sid, s) for sid, s in settlements if isinstance(s, dict) and s.get('decision') == rid]
+    if not mine:
+        return ['unresolved_decision:' + rid]
+    problems = record_problems(rid, record) if not record_invalid(rid, record) else []
+    if problems:
+        return problems
@@ -324,3 +329,0 @@
-    mine = [(sid, s) for sid, s in settlements if isinstance(s, dict) and s.get('decision') == rid]
-    if not mine:
-        return ['unresolved_decision:' + rid]
