proof/VELDO-0054/mutations/invalid-record-not-observed.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -591 +591 @@
-                self._invalid_record(identity, 'decision')
+                pass
