proof/VELDO-0054/mutations/malformed-blocks-govern-nothing.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -175 +175 @@
-    named = _named_ids(blocks) if blocks_malformed(record) else set(blocks)
+    named = set(blocks) if _str_list(blocks) else set()
