proof/VELDO-0054/mutations/malformed-blocks-govern-nothing.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -161 +161 @@
-    named = set(_named(blocks)) if blocks_malformed(record) else set(blocks)
+    named = set(blocks) if _str_list(blocks) else set()
