proof/VELDO-0054/mutations/malformed-blocks-unrecorded.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -578 +578 @@
-                self._invalid_record(identity, 'blocks')
+                pass
