proof/VELDO-0054/mutations/missing-reference-ignored.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -375 +375 @@
-            codes.append('missing_decision:%s' % ref)
+            pass
