proof/VELDO-0054/mutations/plan-inline-resolution-honored.diff
--- a/.veldo/plan.py
+++ b/.veldo/plan.py
@@ -89 +89 @@
-        if isinstance(d, dict):
+        if isinstance(d, dict) and d.get("status") != "resolved":
