proof/VELDO-0054/mutations/plan-reference-unrecorded.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -547 +547 @@
-                self._invalid_record(inputs['plan']['id'], 'open_decisions')
+                pass
