proof/VELDO-0054/mutations/production-trust-not-wired.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -367 +367 @@
-                settlement_trust=settlements)
+                settlement_trust=None)
