proof/VELDO-0054/mutations/reference-invalid-dropped.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -307 +307 @@
-            codes.append('invalid_input:decision_reference')
+            continue
