proof/VELDO-0054/mutations/schema-type-unchecked.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -181,2 +181 @@
-    for name, ok in (('schema', record.get('schema') is None or isinstance(record.get('schema'), str)),
-                     ('decision_id', record.get('decision_id') is None or isinstance(record.get('decision_id'), str)),
+    for name, ok in (('decision_id', record.get('decision_id') is None or isinstance(record.get('decision_id'), str)),
