proof/VELDO-0054/mutations/scope-target-may-differ.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -292,2 +292 @@
-    if body.get('scope_digest') != scope_digest(record.get('scope')) \
-            or (record.get('scope') or {}).get('target') != (record.get('subject') or {}).get('id'):
+    if body.get('scope_digest') != scope_digest(record.get('scope')):
