proof/VELDO-0054/mutations/settlement-invalid-ignored.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -298,2 +297,0 @@
-    if malformed:
-        return malformed
