proof/VELDO-0054/mutations/settlement-nul-passed.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -228,2 +227,0 @@
-    if '\x00' in text:
-        return False
