proof/VELDO-0054/mutations/settlement-unencodable-passed.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -224,4 +223,0 @@
-        return False
-    try:
-        text.encode('utf-8')
-    except UnicodeEncodeError:
