proof/VELDO-0054/mutations/signer-whitespace-allowed.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -243 +243 @@
-        return len(text) <= SIGNER_LIMIT and not any(c.isspace() or ord(c) < 32 or ord(c) == 127 for c in text)
+        return len(text) <= SIGNER_LIMIT
