proof/VELDO-0054/mutations/status-reader-ignores-decisions.diff
--- a/.veldo/runstatus.py
+++ b/.veldo/runstatus.py
@@ -155 +155 @@
-            blocked = PL._decision_blocks(fm, PL.EL.gate_for(Path(root), eligibility))
+            blocked = {}
