proof/VELDO-0054/mutations/status-stop-crashes.diff
--- a/.veldo/runstatus.py
+++ b/.veldo/runstatus.py
@@ -234 +234 @@
-    except Exception as error:  # noqa: BLE001 - a burn-down it cannot build is named, never a crash
+    except ZeroDivisionError as error:  # defect: any other failure escapes
