proof/VELDO-0054/mutations/status-stop-unnamed.diff
--- a/.veldo/runstatus.py
+++ b/.veldo/runstatus.py
@@ -233 +233 @@
-        return [], "burndown_unanswerable:" + type(error).__name__
+        return [], None
