proof/VELDO-0054/mutations/status-store-refusal-code-dropped.diff
--- a/.veldo/runstatus.py
+++ b/.veldo/runstatus.py
@@ -233 +233 @@
-        return [], "refused:" + eligibility.refusal_code(error)
+        return [], "refused:" + type(error).__name__
