proof/VELDO-0054/mutations/subject-currency-ignored.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -296 +296 @@
-    if current is None or subject.get('digest') != current:
+    if False:
