proof/VELDO-0054/mutations/unexpected-controls-kept.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -170 +169,0 @@
-    message = ''.join('\\x%02x' % ord(c) if ord(c) < 32 or ord(c) == 127 else c for c in message)
