proof/VELDO-0054/mutations/unexpected-message-multiline.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -162 +162 @@
-    message = ' '.join(str(error).split())
+    message = str(error)
