proof/VELDO-0054/mutations/unexpected-message-unbounded.diff
--- a/.veldo/control_eligibility.py
+++ b/.veldo/control_eligibility.py
@@ -163 +163 @@
-    message = message.encode('ascii', 'backslashreplace').decode('ascii')[:UNEXPECTED_MESSAGE_LIMIT]
+    message = message.encode('ascii', 'backslashreplace').decode('ascii')
