proof/VELDO-0054/mutations/unsupported-before-settlement-invalid.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -326,0 +327,3 @@
+    problems = record_problems(rid, record)
+    if problems:
+        return problems
@@ -330,3 +332,0 @@
-    problems = record_problems(rid, record)
-    if problems:
-        return problems
