proof/VELDO-0054/mutations/unsupported-before-settlement-invalid.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -310,0 +311,3 @@
+    problems = record_problems(rid, record)
+    if problems:
+        return problems
@@ -314,3 +316,0 @@
-    problems = record_problems(rid, record)
-    if problems:
-        return problems
