proof/VELDO-0054/mutations/unsupported-before-settlement-invalid.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -325,0 +326,3 @@
+    problems = record_problems(rid, record)
+    if problems:
+        return problems
@@ -329,3 +331,0 @@
-    problems = record_problems(rid, record)
-    if problems:
-        return problems
