proof/VELDO-0054/mutations/unsupported-obligation-presumed.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -60 +60 @@
-SUPPORTED_OBLIGATIONS = ()
+SUPPORTED_OBLIGATIONS = ('tripwire', 'adversarial_decision_review')
