proof/VELDO-0054/mutations/verifier-unavailable-as-unsigned.diff
--- a/.veldo/control_decision_dependency.py
+++ b/.veldo/control_decision_dependency.py
@@ -358 +358 @@
-            if not verified and str(detail).startswith('ssh-keygen unavailable'):
+            if False:
