proof/VELDO-0056/mutations/candidate-checks-out-trunk.diff
--- a/.veldo/lander.py
+++ b/.veldo/lander.py
@@ -440,0 +441 @@
+            self._git(self.repo_root, "checkout", self.trunk, ok=None)  # defect: sync_main checks out the trunk
