proof/VELDO-0056/mutations/candidate-publication-not-decided.diff
--- a/.veldo/lander.py
+++ b/.veldo/lander.py
@@ -766 +766 @@
-        decision = gate.decide("publication", sid, context=context)
+        decision = {"decision_id": None, "refusals": []}  # defect: the publication station is not asked
