proof/VELDO-0056/mutations/candidate-refusal-not-observed.diff
--- a/.veldo/lander.py
+++ b/.veldo/lander.py
@@ -403 +403 @@
-        self._event(operation, "refused", error.code, detail=error.detail, failed=error.operation)
+        pass  # defect: a refusal is not observed
