proof/VELDO-0056/mutations/candidate-unknown-classified.diff
--- a/.veldo/lander.py
+++ b/.veldo/lander.py
@@ -137 +137 @@
-    return TAXONOMY.get(str(code).split(":", 1)[0], "unknown_outcome")
+    return TAXONOMY.get(str(code).split(":", 1)[0], "missing_evidence")  # defect: an unknown code is classified
