proof/VELDO-0056/mutations/candidate-watermark-from-caller-trunk.diff
--- a/.veldo/lander.py
+++ b/.veldo/lander.py
@@ -445 +445 @@
-            if self.push:
+            if False:  # defect: the watermark is the caller's local trunk, never the published one
