proof/VELDO-0057/mutations/landing-approval-compared-with-old-tip.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -406 +406 @@
-        exact = {'tree': tree, 'source': fields['evidence'], 'proof': proof, 'dependencies': dependencies}
+        exact = {'tree': fields['watermark'], 'source': fields['evidence'], 'proof': proof, 'dependencies': dependencies}  # defect: the approval is compared with another subject
