proof/VELDO-0057/mutations/landing-approval-dependencies-unbound.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -417 +417 @@
-                differences.append([f for f in SUBJECT_FIELDS if bound.get(f) != exact[f]])
+                differences.append([f for f in SUBJECT_FIELDS if f != 'dependencies' and bound.get(f) != exact[f]])  # defect: the dependency versions approved are not compared
