proof/VELDO-0057/mutations/landing-candidate-objects-not-transferred.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -520 +520 @@
-            self._transfer(candidate, dispatch)
+            pass  # defect: the publication clone never receives the candidate
