proof/VELDO-0057/mutations/landing-chain-candidate-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -545 +545 @@
-        if payload.get('commit') != fields['commit']:
+        if False:  # defect: the candidate is not re-derived
