proof/VELDO-0057/mutations/landing-chain-gate-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -312 +312 @@
-        if _digest(body) != reference.get('digest'):
+        if False:  # defect: the gate observation is not re-read
