proof/VELDO-0057/mutations/landing-chain-implementation-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -548 +548 @@
-        if (manifest or {}).get('commit') != fields['implementation']:
+        if False:  # defect: the implementation commit is not re-derived
