proof/VELDO-0057/mutations/landing-chain-old-tip-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -538 +538 @@
-        if payload.get('old_tip') != fields['watermark']:
+        if False:  # defect: the old tip is not re-derived
