proof/VELDO-0057/mutations/landing-chain-proof-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -546 +546 @@
-        if proof is None or proof != candidate['proof']['digest']:
+        if False:  # defect: the proof digest is not re-derived
