proof/VELDO-0057/mutations/landing-chain-publication-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -622 +622 @@
-            if (data.get('kind') != 'publication' or data.get('dispatch_id') != dispatch or data.get('unit') != sid
+            if (False  # defect: the publication named is not required to be this unit's
