proof/VELDO-0057/mutations/landing-chain-reviewed-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -571,0 +572 @@
+        codes = [c for c in codes if not c.startswith('binding_mismatch:review/')]  # defect: the review is not re-derived
