proof/VELDO-0057/mutations/landing-chain-tested-tree-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -540 +540 @@
-        if payload.get('tree') != fields['tree']:
+        if False:  # defect: the tested tree is not re-derived
