proof/VELDO-0057/mutations/landing-confirmation-from-executor-answer.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -573 +573 @@
-        if tip != fields['commit']:
+        if False:  # defect: the executor's answer is taken for the remote's
