proof/VELDO-0057/mutations/landing-confirmation-read-from-local-clone.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -336 +336 @@
-        found = self._git(self.clone, 'ls-remote', '--', self.remote, self.ref, profile='network')
+        found = self._git(self.clone, 'ls-remote', '--', '.', self.ref, profile='network')  # defect: the publication clone is read for the remote
