proof/VELDO-0057/mutations/landing-new-attempt-for-unknown.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -516 +516 @@
-            if outstanding:
+            if False:  # defect: another publication of the unit is attempted over an unknown one
