proof/VELDO-0057/mutations/landing-old-tip-read-now.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -453 +453 @@
-                    'payload': {'commit': subject['commit'], 'tree': subject['tree'], 'old_tip': subject['old_tip']}}
+                    'payload': {'commit': subject['commit'], 'tree': subject['tree'], 'old_tip': self._remote_tip()}}  # defect: the old tip is whatever the remote holds now
