proof/VELDO-0057/mutations/landing-projection-not-run.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -647 +647 @@
-            projection = self.project()
+            projection = {}  # defect: the projection is not run after the receipt
