proof/VELDO-0057/mutations/landing-review-proof-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -394 +394 @@
-            if (handoff.get('proof') or {}).get('digest') != candidate['proof']['digest']:
+            if False:  # defect: the reviewed proof is not compared
