proof/VELDO-0057/mutations/landing-review-source-unchecked.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -392 +392 @@
-            if (handoff.get('source') or {}).get('commit') != fields['evidence']:
+            if False:  # defect: the reviewed source is not compared
