proof/VELDO-0057/mutations/landing-tree-not-rederived.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -360 +360 @@
-        if tree is None or tree != fields['tree']:
+        if tree is None:  # defect: the recorded tree is taken for the commit's tree
