proof/VELDO-0057/mutations/landing-unknown-attempted-again.diff
--- a/.veldo/control_landing.py
+++ b/.veldo/control_landing.py
@@ -513 +513 @@
-            if recorded is not None:
+            if recorded is not None and recorded['data'].get('status') != 'unknown':  # defect: an unknown one is tried again
