proof/VELDO-0058/mutations/gate-output-acceptance-skips-tree-equality.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -451 +451 @@
-    if now["head"] != commit or now["digest"] != (observation.get("candidate") or {}).get("state"):
+    if False:  # defect: no post-run tree equality at acceptance
