proof/VELDO-0058/mutations/gate-output-candidate-policy-launched.diff
--- a/.veldo/lander.py
+++ b/.veldo/lander.py
@@ -727,2 +727,3 @@
-                returncode, policy_out = verification_organ().run_policy(self._installed(c), c["workspace"],
-                                                                         c["watermark"])
+                pc = subprocess.run([sys.executable, "-B", *POLICY_COMMAND], cwd=c["workspace"], capture_output=True,
+                                    text=True, stdin=subprocess.DEVNULL)  # defect: the candidate's policy decides
+                returncode, policy_out = pc.returncode, pc.stdout.strip()
