proof/VELDO-0058/mutations/gate-output-observation-content-not-judged.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -388 +388 @@
-    problems = judge(observation)
+    problems = []  # defect: the observation's content is not judged again at acceptance
