proof/VELDO-0058/mutations/gate-output-policy-module-from-candidate.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -465 +465 @@
-    policy = root / POLICY_PATH
+    policy = Path(candidate) / POLICY_PATH  # defect: the candidate's policy module is run
@@ -468 +468 @@
-    if inside(policy, candidate):
+    if False:
@@ -483,0 +484 @@
+    return None  # defect: any policy source
