proof/VELDO-0058/mutations/gate-output-policy-module-from-candidate.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -406 +406 @@
-    policy = root / POLICY_PATH
+    policy = Path(candidate) / POLICY_PATH  # defect: the candidate's policy module is run
@@ -409 +409 @@
-    if inside(policy, candidate):
+    if False:
@@ -423,0 +424 @@
+    return None  # defect: any policy source
