proof/VELDO-0058/mutations/gate-output-policy-module-from-candidate.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -431 +431 @@
-    policy = root / POLICY_PATH
+    policy = Path(candidate) / POLICY_PATH  # defect: the candidate's policy module is run
@@ -434 +434 @@
-    if inside(policy, candidate):
+    if False:
@@ -449,0 +450 @@
+    return None  # defect: any policy source
