proof/VELDO-0058/mutations/gate-output-policy-source-not-set.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -447 +447 @@
-    module.POLICY = Path(policy).parent / POLICY_SOURCE
+    pass  # defect: the policy source is left unset, so the candidate's policy.yaml decides
