proof/VELDO-0058/mutations/gate-output-protected-list-from-subject-root.diff
--- a/.veldo/policy_check.py
+++ b/.veldo/policy_check.py
@@ -77 +77 @@
-    policy = _Y.read(policy_source())
+    policy = _Y.read(ROOT / ".veldo" / "policy.yaml")  # defect: the subject root's policy.yaml decides
