proof/VELDO-0058/mutations/gate-output-range-base-not-set.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -528 +528 @@
-    module.BASE = base
+    pass  # defect: the base is checked but never handed to the policy, so the refs decide
