proof/VELDO-0058/mutations/gate-output-reconcile-writes-candidate.diff
--- a/scripts/verify.sh
+++ b/scripts/verify.sh
@@ -204 +204 @@
-  set -- --repo-root "$(pwd -P)" --log "$VELDO_OUT/events.jsonl"
+  set -- --repo-root "$(pwd -P)"  # defect: the reconciliation appends to the candidate's own log
