proof/VELDO-0058/mutations/gate-output-run-equality-not-judged.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -347 +347 @@
-    if post.get("equal") is not True or post.get("state") != candidate.get("state"):
+    if False:  # defect: a candidate changed during the run is judged green
