proof/VELDO-0058/mutations/gate-output-stamp-written-to-candidate.diff
--- a/scripts/verify.sh
+++ b/scripts/verify.sh
@@ -270 +270 @@
-     && mv -f "$VELDO_OUT/.last_verify.$$" "$VELDO_OUT/last_verify" 2>/dev/null \
+     && mv -f "$VELDO_OUT/.last_verify.$$" .veldo/last_verify 2>/dev/null \
