proof/VELDO-0058/mutations/gate-output-state-without-refs.diff
--- a/.veldo/control_verification.py
+++ b/.veldo/control_verification.py
@@ -173 +173 @@
-    refs = _refs(root) if bind_refs else None
+    refs = None  # defect: the refs are not part of the state
