proof/VELDO-0118/mutations/absence-counts-as-agreement.diff
--- a/scripts/fixtures/yaml_oracle.py
+++ b/scripts/fixtures/yaml_oracle.py
@@ -120,0 +121,3 @@
+            if raw['state'] == 'oracle_unavailable':
+                result['compared'] += 1
+                result['agreed'] += 1
