proof/VELDO-0118/mutations/broken-dependency-counts-as-absence.diff
--- a/scripts/fixtures/yaml_oracle.py
+++ b/scripts/fixtures/yaml_oracle.py
@@ -15 +15 @@
-        state = 'oracle_unavailable' if exc.name == 'yaml' else 'oracle_error'
+        state = 'oracle_unavailable'
