proof/VELDO-0118/mutations/delegate-oracle-to-front-matter.diff
--- a/scripts/fixtures/yaml_oracle.py
+++ b/scripts/fixtures/yaml_oracle.py
@@ -104 +104 @@
-        return {'state': 'value', 'value': adapt_node(raw['tree'])}
+        return {'state': 'value', 'value': __import__('yamlish').front_matter(raw['source'])}
