proof/VELDO-0118/mutations/omit-duplicate-key.diff
--- a/scripts/fixtures/grammar_cases.py
+++ b/scripts/fixtures/grammar_cases.py
@@ -646,0 +647,2 @@
+        if rule == 'duplicate-key':
+            continue
