proof/VELDO-0118/mutations/omit-folded-block.diff
--- a/scripts/fixtures/grammar_cases.py
+++ b/scripts/fixtures/grammar_cases.py
@@ -640,0 +641,2 @@
+        if 'folded' in coverage_seen(node, data)['production']:
+            continue
