proof/VELDO-0118/mutations/omit-recursive-pair.diff
--- a/scripts/fixtures/grammar_cases.py
+++ b/scripts/fixtures/grammar_cases.py
@@ -594,0 +595,2 @@
+        if site == ('flow-map', 'value', 'flow-map'):
+            continue
