proof/VELDO-0118/mutations/omit-tab-edit.diff
--- a/scripts/fixtures/grammar_cases.py
+++ b/scripts/fixtures/grammar_cases.py
@@ -649,0 +650,2 @@
+        if rule == 'bad-indentation':
+            continue
