proof/VELDO-0120/mutations/policy-omit-required-result.diff
--- a/scripts/fixtures/policy_agreement.py
+++ b/scripts/fixtures/policy_agreement.py
@@ -198,0 +199,5 @@
+    if omit is not None:
+        cases = cases[1:]
+        expected = expected.copy()
+        del expected[next(iter(expected))]
+        omit = None
