proof/VELDO-0120/mutations/policy-shape-becomes-absent.diff
--- a/.veldo/fix_validation_record.py
+++ b/.veldo/fix_validation_record.py
@@ -250 +250 @@
-        raise ValidationError(f"{policy_path}: {FLAG_KEY} must be a nonempty mapping")
+        return {}
