proof/VELDO-0120/mutations/policy-strip-quoted-hash.diff
--- a/.veldo/fix_validation_record.py
+++ b/.veldo/fix_validation_record.py
@@ -262 +262 @@
-        block[START_KEY] = str(block[START_KEY])
+        block[START_KEY] = str(block[START_KEY]).split('#', 1)[0]
