proof/VELDO-0120/mutations/policy-strip-quoted-hash.diff
--- a/.veldo/yamlish.py
+++ b/.veldo/yamlish.py
@@ -81 +81 @@
-                return ''.join(out)
+                return ''.join(out).split('#', 1)[0]
