proof/VELDO-0120/mutations/policy-syntax-becomes-absent.diff
--- a/.veldo/fix_validation_record.py
+++ b/.veldo/fix_validation_record.py
@@ -243 +243 @@
-        raise ValidationError(f"{policy_path}: {exc}") from exc
+        return {}
