proof/VELDO-0132/mutations/workflow-budget-unchecked.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -506 +506 @@
-            if record['steps'] >= definition['budget']['steps']:
+            if False:  # defect: the cycle budget is not enforced
