proof/VELDO-0132/mutations/workflow-cancel-without-graph.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -449 +449 @@
-            if record['resume'] is not None:
+            if False:  # defect: a cycle is canceled without asking the graph
