proof/VELDO-0132/mutations/workflow-completion-unvalidated.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -558 +558 @@
-        if not received or received not in evidence or not evidence <= offered:
+        if False:  # defect: an asserted completion is not checked against an accepted result
