proof/VELDO-0132/mutations/workflow-cycle-refusal-unobserved.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -272 +272,2 @@
-        self.observe(event)
+        if outcome != 'refused':  # defect: a refusal is not observed
+            self.observe(event)
