proof/VELDO-0132/mutations/workflow-editor-unchecked.diff
--- a/.veldo/control_workflow.py
+++ b/.veldo/control_workflow.py
@@ -473 +473 @@
-    problem = editor_problem(conn, params.get('principal'), repository, params.get('now'))
+    problem = None  # defect: the editor is not judged
