proof/VELDO-0132/mutations/workflow-gate-not-asked.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -369 +369 @@
-        decision = self.gate.decide(STATION, record['subject'])
+        decision = {'eligible': True, 'refusals': [], 'decision_id': None, 'watermark': None}  # defect: the Gate is not asked
