proof/VELDO-0132/mutations/workflow-layout-reaches-runner.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -211 +211 @@
-    text = WF.canonical(revision['definition']).decode()
+    text = WF.canonical(dict(revision['definition'], layout=revision['layout'])).decode()  # defect: the layout reaches execution
