proof/VELDO-0132/mutations/workflow-load-activates-runtime.diff
--- a/.veldo/control_workflow.py
+++ b/.veldo/control_workflow.py
@@ -614,0 +615 @@
+            _organ('control_runtime').activation()  # defect: loading asks the graph runtime
