proof/VELDO-0132/mutations/workflow-loop-bound-unchecked.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -548 +548 @@
-            if 'max' in taken and visits[taken['id']] > taken['max']:
+            if False:  # defect: a loop bound is not enforced
