proof/VELDO-0132/mutations/workflow-pending-unlisted.diff
--- a/.veldo/control_workflow_cycle.py
+++ b/.veldo/control_workflow_cycle.py
@@ -577 +577 @@
-            if (data.get('domain'), data.get('repository')) == (self.domain, self.repository) and data['state'] == 'waiting':
+            if (data.get('domain'), data.get('repository')) == (self.domain, self.repository) and data['state'] == 'running':  # defect: waiting work is not listed
