proof/VELDO-0132/mutations/workflow-save-refusal-unclassified.diff
--- a/.veldo/control_workflow.py
+++ b/.veldo/control_workflow.py
@@ -556 +556 @@
-        self.observe(dict(event, outcome='refused', refusal=error.code, refusals=codes, taxonomy=taxonomy(error.code)))
+        self.observe(dict(event, outcome='refused', refusal=error.code, refusals=codes, taxonomy=None))  # defect: unclassified
