proof/VELDO-0134/mutations/architecture-any-role-signs.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -355 +355 @@
-        if SIGNER_ROLE not in (entry.get('roles') or []):
+        if not (entry.get('roles') or []):  # defect: any role accepts
