proof/VELDO-0134/mutations/architecture-coordinates-unchecked.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -368 +368 @@
-        if any(command[k] != v for k, v in self.ids.items()):
+        if False:  # defect: the command's coordinates are not compared
