proof/VELDO-0134/mutations/architecture-digest-adds-final-newline.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -112 +112 @@
-    return 'sha256:' + hashlib.sha256(body).hexdigest()
+    return 'sha256:' + hashlib.sha256(body if body.endswith(b'\n') else body + b'\n').hexdigest()  # defect
