proof/VELDO-0134/mutations/architecture-digest-decodes-utf8-sig.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -112 +112 @@
-    return 'sha256:' + hashlib.sha256(body).hexdigest()
+    return 'sha256:' + hashlib.sha256(body.decode('utf-8-sig', 'surrogateescape').encode('utf-8', 'surrogateescape')).hexdigest()  # defect
