proof/VELDO-0134/mutations/architecture-digest-normalizes-line-endings.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -112 +112 @@
-    return 'sha256:' + hashlib.sha256(body).hexdigest()
+    return 'sha256:' + hashlib.sha256(body.replace(b'\r\n', b'\n')).hexdigest()  # defect
