proof/VELDO-0134/mutations/architecture-digest-strips-bom.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -112 +112 @@
-    return 'sha256:' + hashlib.sha256(body).hexdigest()
+    return 'sha256:' + hashlib.sha256(body[3:] if body.startswith(b'\xef\xbb\xbf') else body).hexdigest()  # defect
