proof/VELDO-0134/mutations/architecture-digest-universal-newlines.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -112 +112 @@
-    return 'sha256:' + hashlib.sha256(body).hexdigest()
+    return 'sha256:' + hashlib.sha256(__import__('io').TextIOWrapper(__import__('io').BytesIO(body), encoding='utf-8', errors='surrogateescape', newline=None).read().encode('utf-8', 'surrogateescape')).hexdigest()  # defect
