proof/VELDO-0134/mutations/architecture-first-nonce-rewritten.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -416 +416 @@
-                      nonce=command['nonce'])
+                      nonce='consumed-' + command['nonce'])  # defect: another nonce is consumed
