proof/VELDO-0134/mutations/architecture-invalid-structure-accepted.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -447 +447 @@
-        if load.refused:
+        if load.refused and load.kind != 'invalid_structure':  # defect: the validator's verdict is ignored
