proof/VELDO-0134/mutations/architecture-nonce-not-consumed.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -389 +389 @@
-        if self.conn.execute('SELECT 1 FROM nonces WHERE nonce=?', (command['nonce'],)).fetchone():
+        if False:  # defect: the signed nonce is not the one consumed
@@ -416 +416 @@
-                      nonce=command['nonce'])
+                      nonce=command['nonce'] + ':' + command['command_id'])
