proof/VELDO-0134/mutations/architecture-reader-uppercase-hex.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -93 +93 @@
-_DIGEST = re.compile(r'sha256:[0-9a-f]{64}\Z')
+_DIGEST = re.compile(r'sha256:[0-9a-fA-F]{64}\Z')  # defect: uppercase hex is a digest
