proof/VELDO-0134/mutations/architecture-replacement-in-place.diff
--- a/.veldo/control_architecture.py
+++ b/.veldo/control_architecture.py
@@ -467 +467 @@
-            data = dict(prior, contract_version=version + 1, digest=params['digest'], source=source, accepted_by=params['principal'], command_id=params['command_id'], superseded=list(prior['superseded']) + [_entry_of(prior)])
+            data = dict(prior, digest=params['digest'], source=source, accepted_by=params['principal'], command_id=params['command_id'])  # defect: the current entry is overwritten in place
