proof/VELDO-0135/mutations/offers-build-again-after-acceptance.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -226,0 +227 @@
+        return dict(entry, station="build", lane="ready")  # defect: an accepted build is offered again
