proof/VELDO-0135/mutations/offers-dispatch-not-joined.diff
--- a/.veldo/work.py
+++ b/.veldo/work.py
@@ -211 +211 @@
-        if unit.get("floor"):
+        if False:  # defect: no dispatch is joined to the offer it came from
