proof/VELDO-0135/mutations/offers-handoff-claimable.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -247 +247 @@
-        return _held(entry, "handoff")
+        return dict(entry, station="build", lane="ready")  # defect: a handed-off unit is claimable
