proof/VELDO-0135/mutations/offers-recheck-reads-status-line.diff
--- a/.veldo/work.py
+++ b/.veldo/work.py
@@ -125 +125 @@
-        if entry is not None:
+        if entry is not None and False:  # defect: the recheck reads the status line
