proof/VELDO-0135/mutations/offers-recheck-refuses-review.diff
--- a/.veldo/work.py
+++ b/.veldo/work.py
@@ -126 +126 @@
-            if entry["station"] == unit.get("kind"):
+            if entry["station"] == "build":  # defect: a review offer never survives its recheck
