proof/VELDO-0135/mutations/offers-status-line-read.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -248 +248 @@
-    lanes.update({sid: e["lane"] for sid, e in entries.items()})
+    pass  # defect: every lane reads the spec file's status line
