proof/VELDO-0135/mutations/offers-unit-claim-stop-stops-the-read.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -502,2 +502 @@
-                if unit_stop.reason not in CLAIM_STOPS:
-                    raise
+                raise  # defect: one unadmitted unit's claim stop stops the whole frontier read
