proof/VELDO-0135/mutations/offers-unreadable-record-offered.diff
--- a/.veldo/frontier.py
+++ b/.veldo/frontier.py
@@ -215 +215 @@
-    if record is None and version:
+    if False:  # defect: a row that is not a floor record reads as no record
